/*
 * @Description:
 * @Author: fanyunbo
 * @Date: 2024-04-16 18:31:38
 * @LastEditTime: 2024-05-28 17:06:54
 * @LastEditors: liutq
 * @Reference:
 */
const nutritional = [
    {
        title: '亲爱的准母亲，恭喜您在备孕这条路上迈出坚实的一步，维持正常的体重是为了迎接新生命的到来做出的重要准备。在这个特殊的时期，还有许多方面需要您的注意和调整。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '保持当前的健康体重，避免体重大幅波动，为怀孕创造一个良好的体内环境。同时定期进行孕前检查，特别关注可能影响怀孕的健康指标，并针对任何异常情况进行跟踪和管理。推荐加强对不良体态的监测和调整，保持规律的体育锻炼。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '保持当前的健康体重，避免体重大幅波动，为怀孕创造一个良好的体内环境。同时定期进行孕前检查，特别关注可能影响怀孕的健康指标，并针对任何异常情况进行跟踪和管理。推荐加强对不良体态的监测和调整，保持规律的体育锻炼。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用1杯牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '每天应摄入25~35g的大豆及坚果类或其等量制品，优先选择含有高Omega-3的奇亚籽、亚麻籽等种子。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是蓝莓、草莓、蔓越莓等莓果类。但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对备孕期的女性尤其重要。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '减少油炸食品的摄入，每周不超过一次。推荐使用高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等，这些油脂对心血管健康更为有益。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。尽量减少白糖、红糖、蜂蜜等甜味剂的食用，以防过量摄入糖分。同时请选择加碘食盐。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕前至少三个月开始，每日补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、镁、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常运动。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的准母亲，恭喜您在备孕这条路上迈出坚实的一步，维持正常的体重是为了迎接新生命的到来做出的重要准备。在这个特殊的时期，希望您尽可能调整自己的达到最佳状态，以更好的迎接新生命的到来。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕期体重过高可能增加患妊娠糖尿病、妊娠高血压和子痫前期的风险。此外，体重过高还可能影响产后恢复，使体重下降变得更加困难，并可能增加产后抑郁的风险。体重过高的孕妇的胎儿患有出生缺陷的风险略高，还可能增加儿童期肥胖的风险，影响孩子的健康和生活质量。您需要在备孕期尽可能减少体重达到标准状态。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一以上来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 请您确保每天饮用1~2杯脱脂牛奶或相当量的脱脂奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质不仅有利于增加饱腹感并帮助减肥，还可以更多的在减肥期间保留肌肉量。每天应摄入35g的大豆及坚果类或其等量制品，优先选择含有高Omega-3的奇亚籽、亚麻籽等种子'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是蓝莓、草莓、蔓越莓等莓果类，但请不要使用纯果汁或鲜榨果汁替代。同时应减少食用甘蔗、榴莲等高糖水果。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对备孕期的女性尤其重要。甜豆、芦笋等富含膳食纤维的蔬菜也应经常食用。但注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '减少油炸食品的摄入，每周不超过一次，但不推荐极端限制脂肪摄入，过低脂肪饮食会造成饱腹感缺乏。推荐使用高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等，这些油脂对心血管健康更为有益，也可使用1,3型甘油二酯油作为烹饪用油。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。尽量减少白糖、红糖、蜂蜜等甜味剂的食用，以防过量摄入糖分。即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2000}ml饮水',
                        content: '如您进行有氧运动，请在运动后补充运动过程中丢失体重的1.5倍水分。可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕前至少三个月开始，每日补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、镁、维生素K2、益生菌和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常运动。每周推荐150分钟以上的中高强度运动。同时维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的准母亲，首先，恭喜您在备孕这条路上迈出坚实的一步，维持正常的体重是为了迎接新生命的到来做出的重要准备。在这个特殊的时期，希望您尽可能调整自己的达到最佳状态，以更好的迎接新生命的到来。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕期间体重偏低可能对母亲和胎儿带来一系列潜在危害。对母亲而言，体重不足可能导致营养不良、生育问题，增加妊娠并发症的风险，如早产和低出生体重婴儿，同时可能会使产后恢复变得更加困难。母亲的体重偏低可能导致胎儿低出生体重、早产、发育问题，甚至增加长期健康风险，如心血管疾病和糖尿病。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少三分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 请您确保每天饮用1~2杯脱脂牛奶或相当量的脱脂奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有利于肌肉的增加。每天应摄入35g的大豆及坚果类或其等量制品，优先选择含有高Omega-3的奇亚籽、亚麻籽等种子。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入一斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是蓝莓、草莓、蔓越莓等莓果类，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对备孕期的女性尤其重要。富含多糖的菌类也是推荐的，因为可以提升免疫力，低免疫力是低体重时经常会伴随的问题。但注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在30g左右',
                        content: '减少油炸食品的摄入，每周不超过一次，。推荐使用高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等，这些油脂对心血管健康更为有益。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。尽量减少白糖、红糖、蜂蜜等甜味剂的食用，以防过量摄入糖分。同时请选择加碘食盐。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1500}ml饮水',
                        content: '咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕前至少三个月开始，每日补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充蛋白粉、维生素D3、镁、锌、硒、维生素K2、复方消化酶和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '备孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常运动。每周推荐150分钟以上的中高强度运动其中至少一半应为抗阻运动。同时维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，首先，恭喜您成功怀孕，进入了孕早期这个特殊而美妙的时期。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '请您保持现有体重直到孕中期，孕早期由于胎儿非常小，且无需过多营养储存，所以孕早期无需升高体重。同时定期进行相关孕检，并针对任何异常情况进行跟踪和管理。良好的饮食和生活是母子平安的关键，无需刻意强调进补或休息。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。如果您的妊娠反应比较强烈，无法满足每日最低130g碳水化合物（约3两主食）的摄入时，请及时更换为肠内营养制剂或使用肠外营养补充以满足最低需要。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用一杯牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约5g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入25g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要，同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。尽量减少白糖、红糖、蜂蜜等甜味剂的食用，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、维生素B6、镁、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，首先，恭喜您成功怀孕，进入了孕早期这个特殊而美妙的时期。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕早期体重增长过高会增加患妊娠糖尿病、妊娠高血压和子痫前期的风险。还可能会影响产后恢复，使体重下降变得更加困难，并增加产后抑郁的风险。同时也可能增加胎儿巨大症的风险，从而导致分娩过程中的受伤和剖腹产的需要。体重过高孕妇的胎儿患有出生缺陷的风险略高，还可能增加儿童期肥胖的风险，影响孩子的健康和生活质量。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用一杯牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约5g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入25g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。避免食用甘蔗、榴莲等高糖水果。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。可餐前食用小番茄或甜椒，其中的果胶及辣椒素酯对控制体重具有一定帮助。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入，因为他们同样会促进食欲并干扰肠道菌群。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2000}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、维生素B6、镁、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑，由其不推荐使用绿茶提取物或ECCG以及L-肉碱进行孕期间减肥，这可能影响生殖系统或心血管系统。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，首先，恭喜您成功怀孕，进入了孕早期这个特殊而美妙的时期。在这个关键时刻，我们希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕早期体重减少过多会对胎儿产生可预期的危害，短期时间内体重下降超过5%时就会对身体产生明显影响，尤其是在孕期这一敏感时刻，过多的体重减少会严重影响胎儿发育，同时大概率伴随的营养素缺乏也会对胎儿营养摄入造成隐患。容易增加流产、胎儿畸形等概率，并增加低出生体重儿的概率。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。如果存在强烈妊娠反应，推荐以饼干作为主食可能会减少不适感，或采用麦芽糊精等水溶性碳水化合物进行少量多次补充。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 每日仅需多摄入约10g蛋白质即可满足需要',
                        content: '过量摄入高蛋白食物会加重您已经高负荷的肾脏。确保每天至少饮用300ml牛奶或相当量的奶制品，并摄入1个鸡蛋。每天应摄入30g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入一斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '尽可能选择易于消化的蔬菜，或使用破壁机打碎蔬菜做成奶昔或加入主食中制作食品食用。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在30g左右',
                        content: '不推荐食用煎炸食品，过多的油脂可能加重恶心等情况，可通过坚果摄取必须脂肪酸，必要时使用必须脂肪酸补充剂进行补充。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。对于蔗糖蜂蜜等能量甜味剂可适度食用请每日不超过25g添加糖摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。 推荐您使用综合维生素以避免营养缺乏，同时使用增肌粉来满足基础碳水化合物和蛋白质获取。消化酶可能是一个良好的促进消化方法，请在营养师或医生指导下使用。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练，维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到了身体发生快速变化，孕中期开始胎儿将进入加速发育阶段。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期体重增长过高会增加患妊娠糖尿病、妊娠高血压和子痫前期的风险。这不仅可能危及孕期健康，还可能导致难产和剖腹产，从而增加分娩并发症。此外，体重过高还可能影响产后恢复，使体重下降变得更加困难，并增加产后抑郁的风险。母亲的体重过高可能会增加胎儿巨大症的风险，从而可能导致分娩过程中的受伤和剖腹产的需要。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用300ml脱脂牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约10g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入30g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。避免食用甘蔗、榴莲等高糖水果。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。可餐前食用小番茄或甜椒，其中的果胶及辣椒素酯对控制体重具有一定帮助。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2000}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、镁、益生菌、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑，由其不推荐使用绿茶提取物或ECCG以及L-肉碱进行孕期间减肥，这可能影响生殖系统或心血管系统。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到了身体发生快速变化，孕中期开始胎儿将进入加速发育阶段。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕中期体重增长不足可能使胎儿生长受限，从而导致低出生体重，甚至会有早产的可能。过低的体重增长会限制胎儿在子宫内生长发育，长期会对儿童的身体和智力发展造成不良影响。体重增长不足可能会增加分娩时的困难和风险，请您适当增加孕中晚期的体重增长以保持整个孕期的正常体重增长幅度。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少三分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用300ml牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约10g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入30g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入一斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在30g左右',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。适当的饮食调味可增加食欲并促进体重正常。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充蛋白粉、维生素D3、镁、维生素K2、复方消化酶和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练，尤其是带有适度阻抗的训练将有助于肌肉发展。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到了身体发生快速变化，孕中期开始胎儿将进入加速发育阶段。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '您现在的状态非常好，孕中期体重需要有节奏的上升，请每周监测体重变化，同时定期进行相关孕检，并针对任何异常情况进行跟踪和管理。良好的饮食和生活是母子平安的关键，无需刻意强调进补或休息。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用300ml脱脂牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约10g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入30g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充蛋白粉、维生素D3、镁、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练，尤其是带有适度阻抗的训练将有助于肌肉发展。维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到新生命即将降临，这一阶段孩子已经接近发育成熟，但合理的营养对最终结果依然十分重要。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期体重增长过高可能会增加患妊娠糖尿病、妊娠高血压和子痫前期、胎儿巨大症的风险。不仅会危及孕期健康，还会导致难产和剖腹产的需要，从而增加分娩并发症的风险。体重过高可能会影响产后恢复，使体重下降变得更加困难，并增加产后抑郁的风险。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用500ml脱脂牛奶或相当量的脱脂奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约15g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入30g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。避免食用甘蔗、榴莲等高糖水果。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。可餐前食用小番茄或甜椒，其中的果胶及辣椒素酯对控制体重具有一定帮助。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25g左右',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2000}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充维生素D3、镁、益生菌、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。由其不推荐使用绿茶提取物或ECCG以及L-肉碱进行孕期间减肥，这可能影响生殖系统或心血管系统。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练尤其是带有适度阻抗的训练将有助于肌肉发展。请尽可能维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到新生命即将降临，这一阶段孩子已经接近发育成熟，但合理的营养对最终结果依然十分重要。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '孕晚期体重增长不足可能导致胎儿生长受限，从而导致低出生体重，体重增长不足的孕妇也更有可能早产，即婴儿在妊娠37周之前出生。过低的体重增长会限制胎儿在子宫内生长发育，长期会对儿童的身体和智力发展造成不良影响。体重增长不足也会增加分娩时的困难和风险，如难产等。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用500ml牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约15g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入35g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入一斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在30g左右',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。适当的饮食调味可增加食欲并促进体重正常。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充蛋白粉、维生素D3、镁、维生素K2、复方消化酶和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练尤其是带有适度阻抗的训练将有助于肌肉发展。请尽可能维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，相信您已经开始感受到新生命即将降临，这一阶段孩子已经接近发育成熟，合理的营养摄入十分重要。在这个关键时刻，希望您能够采取一切措施，以达到并维持最佳的身体和心理状态，为即将到来的新生命做好准备。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '您现在的状态非常好，孕晚期体重需要有节奏的上升，请每周监测体重变化，同时定期进行相关孕检，并针对任何异常情况进行跟踪和管理。良好的饮食和生活是母子平安的关键，无需刻意强调进补或休息。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少二分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用500ml牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于胎儿发育，但与未怀孕期间相比，您现在每日仅需多摄入约15g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入35g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '如菠菜、西蓝花、生菜等，这些蔬菜富含叶酸，对孕期的女性尤其重要。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25~30g之间',
                        content: '不推荐食用煎炸食品。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{1700}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '孕期请每日按时补充400ug叶酸，以预防神经管缺陷。同时，根据个人情况，可能需要补充蛋白粉、维生素D3、镁、维生素K2和DHA等，但务必在专业营养师或医生的指导下进行。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '怀孕期间，请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天7~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐进行符合您身体状态的锻炼，包括椭圆机、普拉提及力量训练请尽可能维持正常的工作、生活和社交活动。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，随着新生命的降临，您也应该开始恢复自身状态，相信使用科学的管理，可以尽快恢复到孕前身体功能。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '您现在体重减少良好，请继续维持，并力争在产后1年时回归产前体重，这将有利于您的身体健康。产后体重需要科学且合理的减少，在产褥期之后就应该看到体重的降低。您在产褥期结束后较产前升高的体重是为哺乳所储存的脂肪，随着乳汁分泌，这部分脂肪将逐渐分解代谢。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少三分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用500ml牛奶或相当量的奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于乳汁分泌，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入35g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25g左右',
                        content: '不推荐食用煎炸食品，也不推荐煎炸鱼类制成奶白汤。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2100}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。可选择无盐蔬菜汤作为补充水分的一种形式，实际上充足的水是保证乳汁分泌最关键的成分，而非水中的其他物质。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '根据个人情况，可能需要补充蛋白粉、维生素D3、镁、维生素K2和DHA等。务必在专业营养师或医生的指导下进行补充。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '哺乳期间请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天总计8~9小时的充足睡眠，并保持至少1小时的日常户外运动，推荐尽可能早的进行康复训练，这将加快机体恢复，不推荐长时间卧床，这会导致肌肉快速流失和情绪问题。请尽可能快的恢复正常工作、生活和社交活动。情绪波动是影响哺乳的重要原因。'
                    }
                ]
            },
        ]
    },
    {
        title: '亲爱的母亲，随着新生命的降临，您也应该开始恢复自身状态，相信使用科学的管理，可以尽快恢复到孕前身体功能。',
        suggest: [
            {
                title: '基础建议',
                sugArray: [
                    {
                        h2: '',
                        content: '您现在体重减少幅度过低，存在体重滞留风险，请尽快加快减重速度，并力争在产后1年时回归产前体重，这将有利于您的身体健康。产后体重需要科学且合理的减少，您在产褥期结束后较产前升高的体重是为哺乳所储存的脂肪，随着乳汁分泌，这部分脂肪将逐渐分解代谢。'
                    }
                ]
            },
            {
                title: '饮食建议',
                sugArray: [
                    {
                        h2: '主食: 推荐每天主食摄入的原料量约为xg g',
                        content: '主食制品请根据其含水量进行换算，例如大米、馒头、生面条约为1:1.5。推荐每天主食中至少三分之一来自于杂粮和杂豆，以获取充足的微量营养素和膳食纤维，并有利于糖代谢和肠道菌群，由其推荐燕麦、藜麦、鹰嘴豆、豌豆等蛋白质和膳食纤维较高的食物。'
                    },
                    {
                        h2: '鱼禽肉蛋奶: 确保每天至少饮用500ml脱脂牛奶或相当量的脱脂奶制品，并摄入1个鸡蛋。',
                        content: '充足的蛋白质有助于乳汁分泌，但与未怀孕期间相比，您现在每日仅需多摄入约25g蛋白质即可满足需要，过量摄入高蛋白食物会加重您已经高负荷的肾脏。每天应摄入40g的大豆及坚果类或其等量制品。'
                    },
                    {
                        h2: '水果: 每天推荐平均摄入半斤新鲜水果，推荐颜色丰富的水果',
                        content: '尤其是猕猴桃、冬枣、草莓等富含维生素C的水果，这将有助于您缓解压力，但请不要使用纯果汁或鲜榨果汁替代。'
                    },
                    {
                        h2: '蔬菜: 每天至少摄入1斤蔬菜，其中应包含大量的深绿色蔬菜',
                        content: '可餐前食用小番茄或甜椒，其中的果胶及辣椒素酯对控制体重具有一定帮助。同时每周食用一次藻类以补充适当的碘。注意不将土豆、芋头等淀粉类蔬菜计算在内。'
                    },
                    {
                        h2: '食用油: 每日食用油摄入量应控制在25g左右',
                        content: '不推荐食用煎炸食品，也不推荐煎炸鱼类制成奶白汤。推荐在高油酸类油脂，如高油酸花生油、高油酸葵花籽油、橄榄油等基础上，搭配食用富含必须脂肪酸的坚果类油脂。'
                    },
                    {
                        h2: '调味品: 请控制每天的总食盐摄入量不超过5g',
                        content: '包括食盐、味精、酱油及辣椒酱等调味品中的钠含量。避免食用白糖、红糖、蜂蜜等甜味剂，以防过量摄入糖分，即使是木糖醇、阿斯巴甜等低能量或无能量甜味剂也尽可能不摄入。'
                    },
                    {
                        h2: '饮用水: 每天请保持不少于{2100}ml饮水',
                        content: '可选择脱咖啡因的咖啡或绿茶，或没有潜在危害的花草茶，但请不要饮用大黄、（藏）红花、芦荟、番泻叶、枳壳、枳实、薏苡仁等具有妊娠毒性的茶饮。推荐饮用活性炭过滤后的水。可选择无盐蔬菜汤作为补充水分的一种形式，实际上充足的水是保证乳汁分泌最关键的成分，而非水中的其他物质。'
                    }
                ]

            },
            {
                title: '膳食补充剂',
                sugArray: [
                    {
                        h2: '',
                        content: '根据个人情况，可能需要补充蛋白粉、维生素D3、益生菌、镁、维生素K2和DHA等。务必在专业营养师或医生的指导下进行补充。对于任何植物提取物的补充，除非有明确的毒理学研究支持，否则请慎重考虑。'

                    }
                ]
            },
            {
                title: '生活方式',
                sugArray: [
                    {
                        h2: '',
                        content: '哺乳期间请严格禁止吸烟和饮酒，并尽量避免接触二手烟。保证每天总计8~9小时的充足睡眠，并保持至少1小时的日常户外运动，并尽可能保持每日半小时以上的适度耐力训练，我们推荐尽可能早的进行康复训练，这将加快机体恢复，不推荐长时间卧床，这会导致肌肉快速流失和情绪问题。请尽可能快的恢复正常工作、生活和社交活动。情绪波动是影响哺乳的重要原因。'
                    }
                ]
            },
        ]
    }

]
const stitchData = [
    [
        '便秘虽然对备孕没有直接影响，但是便秘意味着肠道菌群和肠道功能存在受损，这会对全身代谢存在隐患，并危害健康。并且怀孕早期往往会有便秘的情况，如果备孕期存在便秘，怀孕后有加重的可能。因此备孕时请尽可能改善便秘症状。',
        '妊娠期高血压是先兆子痫的重要诱因，对母子均存在严重隐患，如您发现存在血压异常，请在改变生活方式的基础上及时就医，并根据医生的推荐进行治疗和定期监测。',
        '血糖异常不仅在孕期会造成流产、死产和胎儿发育问题，更可能在产后演变成二型糖尿病，孕期积极的血糖控制对母子预后非常重要。推荐采用生活方式干预进行控制，如果您的指标已经严重异常，请在医生的指导下使用药物，这将有利于您和孩子的健康。',
        '缺铁不仅会引发胎儿不可逆的认知和智力降低，还会减少胎儿出生时肝脏的铁储存量。请务必在医生的指导下服用合适的铁剂和其他药物，并每月监测血常规以求快速达到合理范围。',
    ],
    [
        '请在主食中增加红薯的摄入量，红薯具有良好的通便作用。',
        '',
        '尽可能选择低血糖生成指数的精粮，如富含抗性淀粉的大米及面粉，这将在不改变口感的前提下，尽可能维持正常血糖代谢。',
        ''
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '西梅、红龙果对于通便是良好的选择，同时请不要使用纯果汁或鲜榨果汁替代。',
        '',
        '',
        '推荐多食用富含维生素C的水果，以增加铁的吸收',
    ],
    [
        '',
        '推荐多食用富含钾元素的蔬菜，高钾可以有效抑制高钠引发的血压升高',
        '餐前食用西红柿等蔬菜可能是一个减少餐后血糖指数的方法。',
        '推荐多食用富含维生素C的蔬菜，以增加铁的吸收，并避免食用高草酸蔬菜。',
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '',
        '请更加严格的进行膳食控盐，避免饮用腌制食品和含盐汤品，同时做菜时不要提前入味，熟后再加盐。推荐使用低钠盐代替正常食盐。',
        '',
        ''
    ],
    [
        '',
        '',
        '',
        '请避免饮用咖啡和茶，即使是脱咖啡因的制品也会阻碍铁的吸收。',
    ],
    [
        '可选择菊粉等具有通便作用的益生元或合生元制剂，并增加无机镁（如碳酸镁）膳食补充剂。',
        '可选择大蒜提取物或陈蒜提取物膳食补充剂，有助于您的血压控制，但是请不要使用复合高血压膳食补充剂，其中可能某些成分对胎儿有害（如南非醉茄）。',
        '可在餐前服用一定量的乳清蛋白，这将有助于胰岛素的分泌。同时可适当补充成胶性膳食纤维，如魔芋葡甘露聚糖等。',
        '应在医生的建议下使用补铁药物，不推荐自行购买补铁膳食补充剂'
    ],
    [
        '减少久坐和久卧并积极运动可有效缓解便秘，同时尽可能养成固定时间排便习惯，这将更有效预防便秘的发生发展。',
        '轻度有氧运动有助于血管功能恢复并平衡血压，尤其是瑜伽、太极拳可能具有身心双重保护的作用，请在生活中尝试添加。',
        '有氧训练和力量训练都有助于血糖改善，尤其是不要忽视肌肉增长带来的代谢收益。',
        ''
    ],
]
const stitchData1 = [
    [
        '缺铁不仅会引发胎儿不可逆的认知和智力降低，还会减少胎儿出生时肝脏的铁储存量。请务必在医生的指导下服用合适的铁剂和其他药物，并每月监测血常规以求快速达到合理范围。',
        '便秘是孕期常见的情况，主要由子宫压迫肠道引发肠道粪便滞留并过多流失水分引发，不仅会影响食欲，还会因干扰肠道功能而影响全身稳态。请尽可能以膳食和生活方式的方法进行干预，必要时可在医生的指导下选择合适的药物治疗。',
        '妊娠期高血压是先兆子痫的重要诱因，对母子均存在严重隐患，如您发现存在血压异常，请在改变生活方式的基础上及时就医，并根据医生的推荐进行治疗和定期监测。',
        '血糖异常不仅在孕期会造成流产、死产和胎儿发育问题，更可能在产后演变成二型糖尿病，孕期积极的血糖控制对母子预后非常重要。推荐采用生活方式干预进行控制，如果您的指标已经严重异常，请在医生的指导下使用药物，这将有利于您和孩子的健康。',
    ],
    [
        '请在主食中增加红薯的摄入量，红薯具有良好的通便作用。',
        '',
        '尽可能选择低血糖生成指数的精粮，如富含抗性淀粉的大米及面粉，这将在不改变口感的前提下，尽可能维持正常血糖代谢。',
        ''
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '西梅、红龙果对于通便是良好的选择，同时请不要使用纯果汁或鲜榨果汁替代。',
        '',
        '',
        '推荐多食用富含维生素C的水果，以增加铁的吸收',
    ],
    [
        '',
        '推荐多食用富含钾元素的蔬菜，高钾可以有效抑制高钠引发的血压升高',
        '餐前食用西红柿等蔬菜可能是一个减少餐后血糖指数的方法。',
        '推荐多食用富含维生素C的蔬菜，以增加铁的吸收，并避免食用高草酸蔬菜。',
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '',
        '请更加严格的进行膳食控盐，避免饮用腌制食品和含盐汤品，同时做菜时不要提前入味，熟后再加盐。推荐使用低钠盐代替正常食盐。',
        '',
        ''
    ],
    [
        '',
        '',
        '',
        '请避免饮用咖啡和茶，即使是脱咖啡因的制品也会阻碍铁的吸收。',
    ],
    [
        '应在医生的建议下使用补铁药物，不推荐自行购买补铁膳食补充剂',
        '可选择菊粉等具有通便作用的益生元或合生元制剂，并增加无机镁（如碳酸镁）膳食补充剂。',
        '可选择大蒜提取物或陈蒜提取物膳食补充剂，有助于您的血压控制，但是请不要使用复合高血压膳食补充剂，其中可能某些成分对胎儿有害（如南非醉茄）。',
        '可在餐前服用一定量的乳清蛋白，这将有助于胰岛素的分泌。同时可适当补充成胶性膳食纤维，如魔芋葡甘露聚糖等。'
    ],
    [
        '减少久坐和久卧并积极运动可有效缓解便秘，同时尽可能养成固定时间排便习惯，这将更有效预防便秘的发生发展。',
        '轻度有氧运动有助于血管功能恢复并平衡血压，尤其是瑜伽、太极拳可能具有身心双重保护的作用，请在生活中尝试添加。',
        '有氧训练和力量训练都有助于血糖改善，尤其是不要忽视肌肉增长带来的代谢收益。',
        ''
    ],
]
const stitchData2 = [
    [
        '产后便秘与怀孕不再存在关联性，更多是可能您没有食用足够富含膳食纤维的粗杂粮及蔬菜水果，以及活动量过小且长时间卧床导致的。人体的肠道对您各个系统均有着重要影响，为了能有更好的恢复，请您尽快调节您的肠道状态。',
        '高血压是心血管疾病风险的第一大高位因素，产后血压升高不是一种特殊状态，而是高血压疾病。所以请不要抱有自愈的心态，它需要通过生活方式及药物进行控制，当然早期血压升高，尤其是肥胖人群可通过减肥恢复至正常血压，但如果持续时间过长，则难以恢复。',
        '如产后依然存在血糖过高，则不再是妊娠糖尿病，它不再是一过性的问题，需要终生进行良好的生活方式干预以及药物治疗。当然，如果是空腹血糖受损，或血糖水平并不高的早期状态，通过良好的生活方式干预是可以恢复正常的。但需要注意的是，即使空腹血糖超过5.6，如不进行任何干预，几乎可以确定未来将转变为糖尿病',
        '产后贫血虽然不会对孩子继续产生影响，也不会影响乳汁的营养。但这会对您的健康及身体恢复产生巨大影响。同时如果您现在依然存在贫血状态，那么您的孩子有可能存在肝脏铁储存不足的可能，请您定时监测孩子的血红蛋白及血清铁蛋白数值，以免未及时发现婴儿贫血情况。',
    ],
    [
        '请在主食中增加红薯的摄入量，红薯具有良好的通便作用。',
        '',
        '尽可能选择低血糖生成指数的精粮，如富含抗性淀粉的大米及面粉，这将在不改变口感的前提下，尽可能维持正常血糖代谢。',
        ''
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '西梅、红龙果对于通便是良好的选择，同时请不要使用纯果汁或鲜榨果汁替代。',
        '',
        '',
        '推荐多食用富含维生素C的水果，以增加铁的吸收',
    ],
    [
        '',
        '推荐多食用富含钾元素的蔬菜，高钾可以有效抑制高钠引发的血压升高',
        '餐前食用西红柿等蔬菜可能是一个减少餐后血糖指数的方法。',
        '推荐多食用富含维生素C的蔬菜，以增加铁的吸收，并避免食用高草酸蔬菜。',
    ],
    [
        '',
        '',
        '',
        ''
    ],
    [
        '',
        '请更加严格的进行膳食控盐，避免饮用腌制食品和含盐汤品，同时做菜时不要提前入味，熟后再加盐。推荐使用低钠盐代替正常食盐。',
        '',
        ''
    ],
    [
        '',
        '',
        '',
        '请避免饮用咖啡和茶，即使是脱咖啡因的制品也会阻碍铁的吸收。',
    ],
    [
        '可选择菊粉等具有通便作用的益生元或合生元制剂，并增加无机镁（如碳酸镁）膳食补充剂。',
        '可选择大蒜提取物或陈蒜提取物膳食补充剂，有助于您的血压控制，但是请不要使用复合高血压膳食补充剂，其中可能某些成分对胎儿有害（如南非醉茄）。',
        '可在餐前服用一定量的乳清蛋白，这将有助于胰岛素的分泌。同时可适当补充成胶性膳食纤维，如魔芋葡甘露聚糖等。',
        '应在医生的建议下使用补铁药物，不推荐自行购买补铁膳食补充剂'
    ],
    [
        '减少久坐和久卧并积极运动可有效缓解便秘，同时尽可能养成固定时间排便习惯，这将更有效预防便秘的发生发展。',
        '轻度有氧运动有助于血管功能恢复并平衡血压，尤其是瑜伽、太极拳可能具有身心双重保护的作用，请在生活中尝试添加。',
        '有氧训练和力量训练都有助于血糖改善，尤其是不要忽视肌肉增长带来的代谢收益。',
        ''
    ],
]
const footContent = [
    [
        { title: '绿豆', value: 625 },
        { title: '鸡肝', value: 588 },
        { title: '黑豆', value: 444 },
        { title: '黄豆', value: 389 },
        { title: '猪肝', value: 212 },
        { title: '藜麦', value: 184 },
        { title: '菠菜', value: 194 },
        { title: '豆芽', value: 168 },
        { title: '苦菊', value: 142 },
        { title: '羽衣甘蓝', value: 129 },
        { title: '西蓝花', value: 63 },
        { title: '菜花', value: 83 },
        { title: '甘蓝', value: 72 },
        { title: '荷兰豆', value: 42 },
        { title: '苹果汁', value: 1 },
    ],
    [
        { title: '黑芝麻', value: 780 },
        { title: '奇亚籽', value: 631 },
        { title: '河虾', value: 325 },
        { title: '海参', value: 285 },
        { title: '大豆', value: 277 },
        { title: '蟹肉', value: 231 },
        { title: '芥菜', value: 115 },
        { title: '上海青', value: 108 },
        { title: '卷心菜', value: 105 },
        { title: '牛奶', value: 100 },
        { title: '牛肉', value: 5 },
        { title: '羊肉', value: 9 },
        { title: '对虾', value: 35 },
        { title: '骨头汤', value: 3 },
        { title: '自来水', value: 20 },
    ],
    [
        { title: '猪肝', value: 22.6 },
        { title: '羊血', value: 18.3 },
        { title: '羊肝', value: 7.5 },
        { title: '牛瘦肉', value: 2.8 },
        { title: '鸭血', value: 30.5 },
        { title: '鸡肝', value: 12 },
        { title: '鸡肉', value: 0.8 },
        { title: '黑芝麻', value: 22.7 },
        { title: '白芝麻', value: 14.1 },
        { title: '海参', value: 13.2 },
        { title: '红糖', value: 2.2 },
        { title: '干红枣', value: 2.1 },
        { title: '红苋菜', value: 2.9 },
        { title: '枸杞', value: 2.4 },
        { title: '桂圆', value: 0.2 },
    ],

]
export { nutritional, stitchData, footContent, stitchData1, stitchData2 }