<template>
  <div class="agreement-container">
    <div class="btn-list">
      <el-button round icon="el-icon-back" @click="goBack()">返回</el-button>
    </div>
    <div class="about-list fix-background">
      <!-- 关于我们 -->
      <div class="visbody-fit">
        <span class="version-number">《隐私政策与个人信息处理方针》</span>
      </div>
      <div class="notice-cont">
        <p>
          本应用程序由西安维塑智能科技有限公司开发，（以下简称“公司”或“VISBODY”)。我们遵守《网络安全法》及相关法令的个人信息保护规定等，依据相关法令制定VISBODY人体成分分析仪(以下简称“服务”)的隐私政策和个人信息处理方针，尽力保护用户的权益。用户有权利拒绝同意收集个人信息，拒绝同意时，服务提供受限可能会带来不利。
        </p>
        <p>本政策仅适用于：</p>
        <p>
          在使用公司各项产品或服务前，请您务必仔细阅读并透彻理解本隐私政策和个人信息处理方针，在确认充分理解并同意后使用相关产品或服务。一旦您点击同意提供个人信息及/或同意提供敏感信息按钮，或开始使用公司各项产品或服务时，即表示您已充分理解并同意本隐私政策和个人信息处理方针。
        </p>
        <p>公司隐私政策和个人信息处理方针的内容如下：</p>
        <ul class="infofi">
          <li>1. 个人信息的收集项目和收集方法</li>
          <li>2. 个人信息的收集、使用目的</li>
          <li>3. 个人信息的共享</li>
          <li>4. 个 人信息的保留</li>
          <li>5. 用户和法定代理人的权利及其行使方法</li>
          <li>6. 查询或投诉</li>
          <li>7. 关于隐私政策和个人信息处理方针的变更事宜</li>
        </ul>

        <br>
        <h3>1. 个人信息的收集项目</h3>
        <p>1) 个人信息的收集项目</p>
        <div>
          我们收集您自愿提供的信息，以及您的计算机、手机、平板电脑、控制台或其他设备（统称为“设备”）或浏览器自动提供的信息。我们使用
          cookie 和其他跟踪技术来使平台更好地为您和广告目的提供服务。您可以选择不使用
          cookie，但如果您这样做，平台的某些功能将无法正常工作。
          <p>
            您提供给我们的信息：当您使用平台时，我们或我们的服务提供商（代表我们行事）收集您提供给我们的“个人信息”（这些信息本身或与其他信息结合时可用于识别您的身份），例如您的姓名、性别、图像、电子邮件地址、
            地理位置、电话号码、邮寄地址、年龄、出生日期、个人资料、位置信息、体重、生物识别数据和某些支付卡信息。
          </p>
          <p>当您出现以下情况时，我们会收集您的信息：</p>
          <h4>一、 注册以创建一个帐户</h4>
          <p>
            公司出于注册会员、顺利提供客户咨询及各种服务的需要，在用户注册会员及使用VISBODY产品登录时，收集以下个人信息：
          </p>
          <p>
            -
            账号、密码、邮箱、所购VISBODY产品的信息、VISBODY产品使用场所的环境信息(有无特许经销权)
          </p>

          <h4>二、 在VISBODY产品上登录，使用平台更新您的信息</h4>
          <p>在VISBODY产品上登录时，收集以下个人信息：</p>
          <p>- VISBODY产品的设置信息</p>

          <h4>三、使用我们的产品或服务</h4>
          <p>在用户使用服务或处理项目的过程中，可能会自动生成并收集以下信息：</p>
          <p>- 设备信息、IP地址、访问时间、服务使用记录、不良使用记录</p>

          <h4>四、通过平台购买商品/服务</h4>
          <p>
            公司出于注册会员，顺利提供客户咨询及各种服务的需要，在VISBODY产品分析人体成分时（以下简称“VISBODY检测”），在‘手机号码输入’或者‘会员号码/手机号码输入’或者‘会员号码输入’的阶段，收集以下个人信息：
          </p>
          <p>-会员号码, 手机号码, 性别, 身高, 年龄、人体成分分析结果</p>

          <h4>
            五、仅向使用附带服务、定制服务或应征参与活动，且同意额外收集个人信息的用户收集额外的信息。
          </h4>
        </div>
        <br>

        <h3>2. 个人信息的收集、使用目的</h3>
            <p>
              我们使用我们收集的有关您的信息为您提供产品和服务，改善您的体验，并行使我们的权利。
            </p>
            <p>我们使用我们收集的关于您的个人信息和从您那里收集的个人信息：</p>
            <ul>
              ● 履行我们与您签订的合同规定的责任。例如：
              <li>
                ●
                如果您使用平台购买商品或服务，我们将需要使用您的个人信息来处理您的订单并实现交付;
              </li>
              <li>
                ●
                我们会将您的身体测量值用于扫描您的目的（例如，提供有关您的健康状况的见解或向您推荐特定产品）;
              </li>
              <li>
                ● 我们需要使用您的个人信息来履行我们的应用程序或网站使用条款规定的义务。
              </li>
            </ul>
            <ul>
              ● 当我们或我们的商业客户对此类使用有合法权益时。例如：
              <li>● 防止欺诈并保护平台的安全;</li>
              <li>● 执行我们的使用条款;</li>
              <li>● 传达更新和改进;</li>
              <li>● 进行市场调查和平台分析;</li>
              <li>● 开发和优化我们的产品和服务;</li>
              <li>
                ●
                向您发送有关我们提供的与您从我们这里购买的产品和服务相似的产品和服务的营销信息;
              </li>
              <li>● 帮助我们提供和运营平台;</li>
              <li>
                ●
                为我们的商业客户提供有关消费者使用平台或我们的产品和服务的分析、人工智能、推荐、受众细分;
              </li>
              <li>● 遵守我们的法律义务。</li>
            </ul>
            <ul>
              ● 征得您的同意。例如：
              <li>● 只有在您同意接收某些营销信息的情况下，我们才会向您发送这些信息。</li>
              <li>
                ● 未经您的同意，我们不会出于第三方的直接营销目的与第三方共享您的个人信息。
              </li>
              <li>
                ●
                在您同意的情况下，我们使用您的信息来个性化您的VISBODY体验，包括：定制我们为您提供的内容、广告和优惠，例如个人训练、健康指导、体重管理、定制剪裁或人体工程学解决方案、3D打印人体模型、雕像或模型、医疗服务、保险或生物识别安全。
              </li>
            </ul>

        <br>
        <h3>3. 个人信息的共享</h3>
        <p>
          公司在「2.
          个人信息的收集和使用目的」公告的范围内使用用户的个人信息，事前未经用户同意，不会超范围使用，原则上不会对外公开用户的个人信息。但以下情况例外：
        </p>
        <ul>
          <li>- 用户事前同意公开时。</li>
          <li>
            -
            依据法令规定或出于搜查目的，搜查机关要求按照法令规定的程序和方法提供个人信息时。
          </li>
          <li>- 行政机关、司法机构等有权机关为了提供各种服务，要求提供个人信息时。</li>
          <li>
            -
            其他VISBODY业务：在适用法律允许的情况下，我们可能会与我们的关联公司共享信息。
          </li>
          <li>
            -
            第三方服务提供商：我们指示其他公司和个人代表我们提供服务。示例包括处理付款、发送电子邮件、分析数据、提供营销帮助和响应客户服务请求。
          </li>
          <li>
            - 业务转让：如果我们被另一家公司收购或合并，我们将与该公司共享您的个人信息。
          </li>
        </ul>
        <br>
        <h3>4. 个人信息的保留</h3>
        <p>
          我们会保留您的信息，直到您要求删除它。一旦您要求删除您的信息，我们只会在必要时保留您的信息，以履行我们的法律义务、解决争议、执行我们的协议或采取法律允许的其他行动。
        </p>
        <ul>
          <li>
            我们通常会存储您的信息，直到您要求我们删除它，或者直到您的帐户被删除，以先到者为准;但这个一般规则也有一些例外。我们将保留已删除帐户中的信息，以遵守法律、防止欺诈、收取费用、解决争议、解决问题、协助调查、处理保修索赔、分发重要产品信息（例如召回信息）、执行我们的协议以及采取法律允许的其他行动。
          </li>
          <li>您可以随时使用下面列出的联系方式联系我们，要求删除您的个人信息。</li>
        </ul>
        <br>
        <h3>5.用户和法定代理人的权利及其行使方法</h3>
        <ul>
          <li>
            访问。您有权访问我们持有的有关您的个人信息。用户和法定代理人可以随时要求查询或解除已注册的本人或相应未满14周岁儿童的个人信息。
            以书面、电话或电子邮件的形式联系个人信息管理负责人的话，经本人验证后，我们会立刻采取相应的措施。
          </li>
          <li>
            准确性。我们将尽最大努力确保我们保留的有关您的个人信息准确无误。我们可能会不时向您发送电子邮件更新，提醒您告诉我们有关您个人信息的任何更新或更改。您有权使用下面列出的联系方式联系我们的数据保护官，要求更正任何不准确的个人信息并填写任何不完整的信息。
          </li>
          <li>
            删除和处理限制请求。您有权要求我们删除我们持有的关于您的个人信息。您还有权要求我们停止处理您的个人信息，但某些例外情况除外。如果您希望我们删除或停止处理我们持有的有关您的个人信息，请使用下面列出的联系方式联系我们。公司将按照「4.
            个人信息的保留」规定处理用户或法定代理人要求注销或删除的个人信息，不会以其他用途查阅或使用该信息。
          </li>
          <li>
            可移植性请求。您有权要求我们向您提供您个人信息的某些部分，或将其直接传输给处理个人信息的另一家公司。如果您希望我们传输您的个人信息，请使用下面列出的联系方式联系我们。
          </li>
        </ul>
        <br>
        <h3>6. 查询或投诉</h3>
        <p>
          如有疑问，请与我们联系。如果您对我们使用您个人信息的方式不满意，您可以向我们的数据保护官或您所在国家/地区的数据保护机构投诉。
        </p>
        <ul>
          <li>
            如果您对本隐私政策或我们对您个人信息的使用有任何疑问或疑虑，您可以向个人信息保护投诉邮箱(hello@visbody.com
            )投诉，表明您在使用公司服务过程中遇到的所有对个人信息保护措施的不满。
          </li>
          <li>公司会迅速、充分地处理用户的投诉。</li>
        </ul>
        <br>
        <h3>7. 关于隐私政策和个人信息处理方针的变更事宜</h3>
        <p>
          公司隐私政策和个人信息处理方针的内容可能随相关法令、安全技术、公司管理系统及政策的变更而随时增加、删除或修改，更新后的隐私政策和个人信息处理方针一经公布即有效代替原来的隐私政策和个人信息处理方针。我们建议您定期查看本文件以了解我们对于个人信息保护的最新措施。
        </p>

        <p>本隐私政策和个人信息处理方针更新于2024年 1月 15日</p>
      </div>
    </div>
  </div>
</template>

<script type="text/ecmascript-6">
export default {
    data() {
        return {}
    },
    methods: {
        goBack() {
            this.$router.push({
                path: '/custom'
            })
        }
    }
}
</script>

<style scoped lang="less">
.agreement-container {
  padding: 25px 78px;
  width: 100%;
  .btn-list {
    text-align: left;
  }
}
.content {
  margin: 40px 0 0;
  background-color: #fff;
  padding: 72px 260px;
}
.infofi {
  list-style-type: none;
}
.tel {
  text-decoration: none;
  color: #4a90e2;
}
.infonone {
  list-style-type: none;
  margin-left: 20px;
}
.info {
  list-style-type: decimal;
  margin-left: 20px;
}
.h1 {
  font-size: 16px;
  font-weight: bold;
  margin: 8px 0;
}
.bold {
  font-weight: bold;
}
.about-list {
  // width: 100%;
  height: auto;
  // background: linear-gradient(top, #242646, #07090f);
  font-size: 14px;
  // color: #fff;
  position: relative;

  &.fix-background {
    position: fixed;
    height: 100%;
    overflow: scroll;
    padding: 0 18%;
  }
}
.visbody-fit {
  width: 90%;
  padding: 30px 0 10px;
  margin: 0 auto;
  text-align: center;
  border-bottom: 1px solid rgba(255, 255, 255, 0.2);
  span{
        font-size: 26px;
    }
}
.notice-cont {
  text-align: left;
  margin: 0 auto 120px;
  padding: 20px;
  font-size: 14px;
  line-height: 24px;
}
.version-number {
  font-size: 16px;
  line-height: 22px;
  letter-spacing: 1px;
}
</style>
