<template>
    <div class="about-list fix-background">
        <!-- 关于我们 -->
        <div class="visbody-fit">
            <span class="version-number">维塑服务条款</span>
        </div>
        <div class="notice-cont">
            <p>
               【统一合规声明】本协议专用于中国大陆地区，协议内容严格依据《中华人民共和国个人信息保护法》、《中华人民共和国数据安全法》、《中华人民共和国网络安全法》等法律法规制定。如本协议条款与法律法规强制性规定冲突，以法律法规强制性规定为准。
            </p>
            <p >
               本服务条款是维塑移动端（以下简称"本系统"）的经营者维塑智能科技有限公司（以下简称"我们"或"维塑"）与本系统使用者（下称为"用户"），共同缔结的对双方具有约束力的有效契约。维塑向用户提供本系统上所展示的产品与服务，并将不断更新服务内容，最新的维塑服务以本系统上的相关产品及服务介绍的页面展示以及向用户实际提供的为准。
            </p>
        </div>
        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">1、总则</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
                1.1、您确认：您在使用本服务之前，已经充分阅读、理解并接受本服务条款的全部内容，一旦您选择"同意"并完成注册流程或使用本服务，即表示您同意遵循本服务条款之所有约定，并受本协议约束；<span class="span-view">如您不同意本协议，应立即停止使用本服务</span>。
            </p>
            <p>
                1.2、您同意：维塑有权随时对本服务条款及相应的服务规则内容进行单方面的变更，并有权以消息推送、网页公告等方式予以公布，而无需另行单独通知您；若您在本服务条款内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的条款内容使用本服务；若您不同意修改后的服务条款，您应立即停止使用本服务。
            </p>
        </div>


        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">2、账户管理</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p class="title-1">2.1、注册</p>
            <p class="title-2">2.1.1、注册者资格</p>
            <p>
                2.1.1.1、您确认，在您完成注册程序或以其他维塑允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织（以下统称为"法律主体"）。
            </p>
            <p>
                2.1.1.2、若您是未成年人或限制民事行为能力人，则您不具备前述主体资格，您及您的监护人应承担因您的不当注册行为而导致的一切后果，且维塑有权注销（永久冻结）您的账户，并向您及您的监护人索偿。
            </p>
            <p class="title-2">2.1.2、注册、账户和实名认证</p>
            <p>
                2.1.2.1、在您按照注册页面提示填写信息、阅读并同意本服务条款且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本服务条款且完成全部激活程序后，或您以其他维塑允许的方式实际使用本系统服务时，您即受本服务条款约束。您可以使用注册时的账户名登录进入本系统。
            </p>
            <p>
                2.1.2.2、您了解并同意，您在本系统完成的注册程序并注册成功后，您即已获得维塑账户。
            </p>
            <p>
                2.1.2.3、目前维塑允许一个法律主体拥有多个维塑账户，但一个维塑账户仅能对应唯一的法律主体。除非有法律规定或生效法律文书确定，或者符合维塑公布的条件，否则您不得以任何方式转让、赠与或让他人继承您的维塑账户。同时，在进行符合条件的维塑账户转让、赠与或继承时，维塑有权要求您、及/或受让受赠者、或您的继承人提供合格的文件材料并按照维塑要求的操作流程办理。
            </p>
            <p>
                2.1.2.4、您了解并同意，为保证账户和交易安全，维塑有权随时要求您完成维塑账户的实名认证；实名认证应符合《中华人民共和国网络安全法》的要求，用户需通过官方提供的身份核验渠道（如手机号实名验证、身份证实名认证、人脸识别、公安联网核验等）确保身份信息真实性、有效性。同时，维塑可能会就某些产品或服务的开通，要求您提供更多的身份资料和信息，做进一步的身份认证或资格验证，您的账户只有在通过这些认证和验证之后，方可获得使用相关产品或服务的资格。
            </p>
            <p>
                2.1.2.5、通常情况下，您的维塑账户是您在本系统进行一切活动的唯一身份识别依据，每一个维塑账户都可以在本系统独立开展活动。
            </p>

            <p class="title-2">2.1.3、信息</p>
            <p>
                2.1.3.1、在完成注册或激活流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，维塑将向您发出询问及/或要求改正的通知，并给予您合理的更正期限。若您未在期限内更正，维塑有权中止或终止对您提供部分或全部服务。维塑对因您提供不实资料导致的直接损失不承担责任，但将依法采取合理措施减少损失。
            </p>
            <p>
                2.1.3.2、您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址等联系方式，以便维塑或其他会员与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用维塑服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按维塑的要求进行操作。
            </p>

            <p class="title-1">2.2、账户安全</p>
            <p>
               2.2.1、您须自行负责对您的维塑账户和密码保密，且须对您在该登录名和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(a)如发现任何人未经授权使用您的维塑账户和密码，或发生违反保密规定的任何其他情况，您会立即通知维塑；及(b)确保您在每个上网时段结束时，以正确步骤离开本系统。维塑不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您理解维塑对您的请求采取行动需要合理时间，维塑对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
            </p>
            <p>
                2.2.2、 除非有法律规定或司法裁定，且征得维塑的同意，否则，您的维塑账户不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。
            </p>
            <p>
                2.2.3、您理解并同意，维塑有权了解您使用本系统产品及服务的真实背景及目的，有权要求您如实提供真实、全面、准确的信息；如果维塑有合理理由怀疑您提供的信息不真实、您进行虚假交易，或您的行为违反本系统规则的，维塑有权暂时或永久限制您账户下所使用的所有产品及/或服务的部分或全部功能。
            </p>
            <p>
               2.2.4、您理解并同意，维塑有权按照国家司法、行政、军事、安全等机关（包括但不限于公安机关、检察机关、法院、海关、税务机关、安全部门等）的要求对您的个人信息、交易及账户等进行查询、冻结或扣划。
            </p>

            <p class="title-1">2.3、账户注销</p>
            <p>
               2.3.1、维塑保留在您违反国家、地方法律法规规定或违反本服务条款的情况下，中止或终止为您提供部分或全部服务、直至注销维塑账户的权利。
            </p>
            <p>
                2.3.2、您理解并同意，如您连续12个月未使用您的维塑账户登录过本系统，且您的账户下不存在任何未到期的服务，维塑有权注销您的登录名--在系统中删除相关账号及登录名，您将不能再登录本系统。
            </p>

        </div>


        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">3、系统服务使用守则</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
                为有效保障您使用本服务的合法权益，您理解并同意接受以下规则：
            </p>
            <p>
               若维塑平台使用算法推荐或自动化决策功能，将严格按照《互联网信息服务算法推荐管理规定》明确向您告知算法推荐的基本原则、目的及您的自主选择权，您可随时选择关闭或拒绝相关算法推荐服务。
            </p>
            <p>
                3.1、您通过包括但不限于以下方式向维塑发出的指令，均视为您本人的指令，不可撤回或撤销，您应自行对维塑执行前述指令所产生的任何结果承担责任。
            </p>
            <p>
               3.1.1、通过您的维塑账户和密码进行的所有操作；
            </p>
            <p>
                3.1.2、通过与您的账号绑定的手机号码向维塑发送的全部信息；
            </p>
            <p>
               3.1.3、通过与您的账号绑定的其他硬件、终端、软件、代号、编码、代码、其他账户名等有形体或无形体向维塑发送的信息；
            </p>
            <p>
                3.1.4、其他维塑与您约定或维塑认可的其他方式。
            </p>
            <p>
                3.2、您在使用本服务过程中，本服务条款内容、页面上出现的关于交易操作的提示或维塑发送给您的信息（短信/电话/邮件等）内容是您使用本服务的相关规则，您使用本服务即表示您同意接受本服务的相关规则。您了解并同意维塑有权单方修改服务的相关规则，而无须征得您的同意，服务规则应以您使用服务时的页面提示（或发送的短信/电话/邮件等）为准，您同意并遵照服务规则是您使用本服务的前提。
            </p>
            <p>
               3.3、维塑可能会以发送给您的短信、电话或邮箱等方式通知您服务进展情况以及提示您进行下一步的操作，但维塑不保证您能够收到或者及时收到该短信或电话等，且不对此承担任何后果。因此，在服务过程中您应当及时登录到本系统查看和进行交易操作。因您没有及时查看和对服务状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，维塑不负任何责任。
            </p>
            <p>
               3.4、您授权维塑可以通过向第三方审核您的身份和资格，取得您使用本服务的相关资料。
            </p>
            <p>
                3.5、在您开始使用维塑的某一产品或服务前，可能需要和维塑就这一产品或服务签订单独的服务协议。您只有在接受该服务协议的全部内容后方可使用该产品或服务；如您不同意该服务协议的部分或者全部的，请您不要进行后续操作。
            </p>
            <p>
               3.6、 在您使用维塑服务时，维塑有权依照相应的产品/及或服务收费介绍、订单及/或相关协议向您收取服务费用。维塑拥有制订及调整服务费之权利，具体服务费用以您使用本服务时页面上所列之收费方式公告或您与维塑达成的其他书面协议为准。
            </p>
            <p>
               3.7、特别提示
            </p>
            <p>
               3.7.1、当您因服务到期而被终止服务前，维塑将通过合理方式，如提前15天短信或邮件通知等，提醒您自行备份相关数据--在管理平台中下载导出相关报告文件等。维塑不承诺提供因服务到期而衍生的数据恢复、备份、保存等功能，但将尽合理努力协助您完成数据迁移。
            </p>
            <p>
              3.8、申诉及处理
            </p>
            <p>
               3.8.1、在您使用维塑服务的过程中，有可能因为存在本服务条款第5.3条所列情形之一，而被维塑采取了包括但不限于停止全部或部分服务、限制服务的全部或部分功能、冻结全部或部分账户资金等措施，维塑将通过邮件、站内信、短信或电话等方式通知您按照相应的程序进行申诉。
            </p>
            <p>
               3.8.2、您通过申诉程序，向维塑申请解除上述限制或冻结或恢复服务的，应按照维塑的要求，如实提供身份证明及相关资料，以及维塑要求的其他信息或文件，以便维塑进行核实。您应充分理解您的申诉并不必然被允许，维塑有权依照自行判断来决定是否同意您的申诉请求。
            </p>
            <p>
               3.8.3、您理解并同意，如果您拒绝如实提供身份证明及相关资料的，或未能通过维塑审核的，维塑有权长期冻结该等账户且长期限制该等产品或者服务的部分或全部功能。
            </p>
            <p>
              3.9、关于第三方
            </p>
            <p>
               3.9.1、 如果您通过使用本服务，将获取使用来自第三方的任何产品或服务，您还可能受限于该等第三方的相关条款和条件，维塑对此不予过问亦不承担任何责任，本服务条款不影响您与该第三方的法律关系。
            </p>
            <p>
               3.9.2、您确认并同意，维塑的各关联公司均为本服务条款的第三方受益人，且维塑关联公司有权直接强制执行并依赖本服务条款中授予其利益的任何规定。除此之外，任何第三方均不得作为本服务条款的第三方受益人。
            </p>
        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">4、您的权利和义务</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
                4.1、您有权利享受维塑提供的互联网技术和信息服务，并有权利在接受维塑提供的服务时获得维塑的技术支持、咨询等服务，服务内容详见本系统相关产品介绍。
            </p>
             <p>
                4.2、您保证不会利用技术或其他手段破坏或扰乱本系统及维塑其他客户的系统。
            </p>
            <p>
                4.3、您应尊重维塑及其他第三方的知识产权和其他合法权利，并保证在发生侵犯上述权益的违法事件时尽力保护维塑及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失；维塑保留您侵犯维塑合法权益时终止向您提供服务并不退还任何款项的权利。
            </p>
             <p>
                4.4、对由于您向维塑提供的联络方式有误以及您用于接受维塑邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，您应自行承担责任，包括但不限于因您未能及时收到维塑的相关通知而导致的后果和损失。
            </p>
            <p>
               4.5、您保证：
            </p>
             <p>
               4.5.1、您使用维塑产品或服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用维塑提供的服务进行存储、发布、传播如下信息和内容：违反国家法律法规政策的任何内容（信息）；违反国家规定的政治宣传和/或新闻信息；涉及国家秘密和/或安全的信息；封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的 信息；博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；妨碍互联网运行安全的信息；侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共 道德的信息或内容;您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接 等;
            </p>
            <p>
                    4.5.2、使用维塑产品或服务时，应遵守您与维塑签订的服务条款、维塑在
                    <a style="color: blue;" href="https://Visbody.com" target="_blank">https://Visbody.com</a>、
                    <a style="color: blue;" href="https://www.visbody.ai" target="_blank">https://www.visbody.ai</a>、
                    <a style="color: blue;" href="https://ai.visbody.com" target="_blank">https://ai.visbody.com</a>、
                    <a style="color: blue;" href="https://wellnesshub.visbodyfit.com" target="_blank">https://wellnesshub.visbodyfit.com</a>、
                    <a style="color: blue;" href="https://аpp-apro5.visbody.com" target="_blank">https://аpp-apro5.visbody.com</a>、
                    <a style="color: blue;" href="https://аpp-rpro3.visbody.com" target="_blank">https://аpp-rpro3.visbody.com</a>、
                    <a style="color: blue;" href="https://аpp-apro7.visbody.com" target="_blank">https://аpp-apro7.visbody.com</a>、
                    <a style="color: blue;" href="https://аpp-rpro5.visbody.com" target="_blank">https://аpp-rpro5.visbody.com</a>、相关页面上的管理规范、流程、服务说明、价格说明和您确认同意的订购页面的内容，包括但不限于：
             </p>
            <p>
                4.5.2.1、您应按时付款；
            </p>
            <p>
                4.5.2.2、不应出现任何破坏或试图破坏网络安全的行为等； 如您违反上述保证，维塑除有权根据相关服务条款采取删除信息、中止服务、终止服务的措施，并有权限制您账户如新购产品或服务、续费等部分或全部功能，如因您上述行为给维塑造成损失的，您应予赔偿。
            </p>
            <p>
               4.5.2.3、若您使用的某项服务中包含可下载的维塑软件，则维塑仅授予您非独占性的、不可转让的、非商业运营目的的个人使用许可。除非维塑另有明示或与您另有约定外，您不得复制、修改、发布、出售或出租服务或所含软件的任何部分，也不得进行反向工程或试图提取该软件的源代码。
            </p>

        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">5、维塑的权利和义务</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
                5.1、维塑应根据您选择的服务以及交纳款项的情况向您提供合格的网络技术和信息服务。
            </p>
            <p>
                5.2、维塑承诺对您资料采取对外保密措施，不向第三方披露您资料，不授权第三方使用您资料，除非：
            </p>
            <p>
                5.2.1、依据本服务条款或者您与维塑之间其他服务协议、合同、在线条款等规定可以提供；
            </p>
            <p>
                5.2.2、依据法律法规的规定应当提供；
            </p>
            <p>
                5.2.3、行政、司法等职权部门要求维塑提供；
            </p>
            <p>
                5.2.4、您同意维塑向第三方提供；
            </p>
            <p>
                5.2.5、维塑解决举报事件、提起诉讼而提交的；
            </p>
            <p>
                5.2.6、维塑为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的；
            </p>
            <p>
                5.2.7、维塑为向您提供产品、服务、信息而向第三方提供的，包括维塑通过第三方的技术及服务向您提供产品、服务、信息的情况。
            </p>
            <p>
                5.3、维塑有权根据本服务条款的约定，根据您的服务使用情况，自您的账户余额中直接扣除相关服务费用。
            </p>
            <p>
                5.4、当存在如下情形之一时，维塑有权对您名下账户资金的部分或全部进行冻结：
            </p>
            <p>
                5.4.1、国家法律、法规、政策、法律文书的规定；
            </p>
            <p>
                5.4.2、国家有权机关要求进行冻结；
            </p>
            <p>
               5.4.3、您使用维塑服务的行为涉嫌违反国家法律法规及行政规定，且维塑已获得初步证据；
            </p>
            <p>
               5.4.4、维塑基于合理判断，认为您的账户操作、资金进出等存在异常，且已向您发出风险提示；
            </p>
            <p>
               5.4.5、他人向您账户错误汇入资金等导致您可能存在不当得利，且维塑已核实相关情况；
            </p>
            <p>
               5.4.6、您遭到他人投诉，且对方已提供初步证据，维塑已进行初步核实；
            </p>
            <p>
               5.4.7、其他维塑根据合理判断认为可能产生风险的情况，但维塑将及时通知您并说明理由。维塑按照前述规定对您的账户资金进行冻结后，将通过邮件、站内信、短信或电话等方式通知您按照相应的程序进行申诉。如果您按照本服务条款第3.8条的要求 进行申诉并经维塑审核通过的，维塑将立即解除资金冻结措施；如果您未在规定时间内进行申请，或您的申诉未能通过维塑审核的，则您确认维塑有权长期冻结该资金，或将相关冻结款项按原路退回该笔资金的充值来源账户（包括但不限于银行账户、支付宝账户、微信等）。

            </p>
        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">6、隐私及其他个人信息的保护</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>一旦您同意本服务条款或使用本服务，您即同意维塑按照以下条款来使用和披露您的个人信息。</p>
            <p class="title-1">6.1 隐私信息服务</p>
            <p>
                6.1.1、 指维塑基于您所使用的功能软件会对您的个人信息进行相关隐私信息提取您的脸部特征信息或指纹特征值信息进行身份识别的一种生物识别行为。
            </p>
            <p>
              6.1.2、 当你使用人脸识别功能时，为进行身份核验，因企业用户要求的入场方式不尽相同，我们可能会在企业用户的指示下收集你主动提供的人脸图像信息。上述生物识别信息属于敏感信息，拒绝提供该信息仅会使你无法使用人脸识别功能，但不影响你正常使用维塑相关产品的其他功能。
            </p>
            <p>
                6.1.3、 当你使用相关功能需要使用指纹特征值信息时，为进行身份核验，因企业用户要求的入场方式不尽相同，我们可能会在企业用户的指示下收集你主动提供的指纹特征值信息。上述生物识别信息属于敏感信息，拒绝提供该信息仅会使你无法使用相关需要使用指纹特征信息的功能，但不影响你正常使用维塑相关产品的其他功能。
            </p>
            <p>
                6.1.4、 您确认已经阅读并理解本协议的全部内容，包括免除和限制维塑责任的条款。维塑已采取合理方式提请您注意相关条款，并已按照您的要求予以说明。
            </p>
            <p>
                6.1.5、 您应保证使用账户人脸识别服务或指纹特征值信息时提供的信息是您本人的信息，并保证该信息的真实、准确、完整，否则，由此引发的起后果由您本人自行承担，维塑不承担任何责任。
            </p>

            <p class="title-1">6.2 登录名和密码</p>
            <p>
                在您注册账户时，维塑会要求您设置维塑账户登录名和密码来识别您的身份。您仅可通过您设置的密码来使用该账户，如果您泄漏了密码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账户和密码因任何原因受到潜在或现实危险时，您应该立即和维塑取得联系，在维塑采取行动前，维塑对此不负任何责任。您理解维塑对您的请求采取行动需要合理时间，维塑对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。
            </p>

            <p class="title-1">6.3 银行账户信息</p>
            <p>
               若维塑所提供的服务需要您提供您的银行账户信息，在您提供相应信息后，维塑将严格履行相关保密约定。维塑对您个人信息进行实名认证后，有权记录并保存经过认证的相关信息。
            </p>

            <p class="title-1">6.4 登录记录</p>
            <p>
               为了保障您使用本服务的安全以及不断改进服务质量，维塑将记录并保存您登录和使用本服务的相关信息，但维塑承诺不将此类信息提供给任何第三方（除双方另有约定或法律法规另有规定及维塑关联公司外）。
            </p>

            <p class="title-1">6.5 广告</p>
            <p>
               维塑会对维塑用户的身份数据进行综合统计，并出于销售和奖励的需要使用或披露。
            </p>

            <p class="title-1">6.6 外部链接</p>
            <p>
               本系统含有到其他系统的链接，但维塑对其他系统的隐私保护措施不负任何责任。维塑可能在任何需要的时候增加商业伙伴或共用品牌的系统。
            </p>

            <p class="title-1">6.7 安全</p>
            <p>
               维塑仅按现有技术提供相应的安全措施来使维塑掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。尽管有这些安全措施，但维塑不保证这些信息的绝对安全。
            </p>

            <p class="title-1">6.8 用户信息</p>
            <p>
               您完成账户注册或激活账户时，应向维塑提供您的真实姓名、地址、国籍、电话号码和电子邮件地址，您还可以选择来填写相关附加信息（包括但不限于您公司所在的省份和城市、时区和邮政编码、传真号码、个人主页和您的职务）。您同意本协议时您即表明同意维塑，及其各自代表和代理可为运作本服务和/或第6.1至 6.7条的目的地合理提出之各项目的而收集、使用和/或披露和互相分享您的个人资料，并将这些个人信息披露给授权服务提供商和相关第三方。
            </p>

            <p class="title-1">6.9 您进一步同意维塑：</p>
            <p>
               6.9.1、 向您发送定制化的信息或新产品/服务信息，通过邮件、电话（包括语音电话、传真或信息，如果您表明我们可以以此方式联系您）；
            </p>
            <p>
               6.9.2、 出于为您提供增强或分析的统计功能使用您的个人信息，或者出于销售或鼓励的目的使用或披露个人信息
            </p>

        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">7、系统中断或故障</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>本系统可能因下列状况无法正常运作，使您无法使用各项互联网服务时，维塑不承担损害赔偿责任，该状况包括但不限于：</p>
            <p>7.1、系统停机维护期间。</p>
            <p>7.2、电信设备出现故障不能进行数据传输的。</p>
            <p>7.3、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成维塑系统障碍不能执行业务的。</p>
            <p>7.4、由于黑客攻击、电信部门技术调整或故障、系统升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>
            <p>7.5、维塑合作的云服务提供商（包括但不限于阿里云、华为云、AWS等）出现系统异常、服务中断、设备故障或其他技术问题导致的服务不可用。</p>
        </div>


        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">8、责任范围及责任限制</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>8.1、维塑仅对本服务条款中列明的责任承担范围负责。</p>
            <p>8.2、本服务之合作单位，所提供之服务品质及内容由该合作单位自行负责。</p>
            <p>
                8.3、您了解并同意，因您使用本服务、违反本服务条款或在您的账户下采取的任何行动，而导致的任何第三方索赔，应且仅应由您本人承担。如果由此引起维塑及其关联公司、员工、客户和合作伙伴被第三方索赔的，您应负责处理，并承担由此造成的全部责任。
            </p>
            <p>
                8.4、在法律允许的范围内，维塑对于与本服务条款有关或由本服务条款引起的间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据、商誉或其他经济利益的损失），仅在因维塑故意或重大过失造成时承担相应责任。
            </p>
            <p>
                8.5、除本服务条款另有规定或维塑与您就某一具体产品及/或服务另有约定外，在任何情况下，您同意维塑对本服务条款所承担的赔偿责任总额不超过向您收取的当次服务费用总额。
            </p>
        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">9、完整协议</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>9.1、本服务条款由本服务条款与本系统公示的各项规则组成，相关名词可互相引用参照，如有不同理解，以本服务条款为准。</p>
            <p>9.2、本服务条款的章节标题仅为行文方便而设，不具有法律或合同效力。</p>
            <p>
                9.3、您对本服务条款理解和认同，您即对本服务条款所有组成部分的内容理解并认同，一旦您使用本服务，您和维塑即受本服务条款所有组成部分的约束。
            </p>
            <p>
                9.4、本服务条款部分内容被有管辖权的法院认定为违法的，不因此影响其他内容的效力。
            </p>
        </div>

        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">10、商标、知识产权的保护</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
                10.1、除第三方产品或服务外，本系统上所有内容，包括但不限于著作、图片、档案、资讯、资料、架构、页面设计，均由维塑或维塑关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
            </p>
            <p>
                10.2、非经维塑或维塑关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本系统上程序或内容。
            </p>
            <p>
                10.3、尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。
            </p>
        </div>


        <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">11、通知送达</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
               11.1、您理解并同意，维塑可依据自行判断，通过网页公告、电子邮件、手机短信或常规的信件传送等方式向您发出通知，且维塑可以信赖您所提供的联系信息是完整、准确且当前有效的；上述通知于发送之日视为已送达收件人。
            </p>
            <p>
                11.2、除非本服务条款另有约定或维塑与您另行签订的协议明确规定了通知方式，您发送给维塑的通知，应当通过维塑对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
            </p>
        </div>

         <div class="visbody-fit" style="padding-top: 0px;">
            <span class="version-number-1">12、法律适用与争议解决</span>
        </div>
        <div class="notice-cont" style="padding-top: 0px;">
            <p>
               本服务条款之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本服务条款产生之争议，均应依照中华人民共和国法律予以处理，并提交于西安维塑智能科技有限公司住所地的人民法院处理。如您对协议内容存在疑问或投诉，请及时联系我们的客户服务部门反映。我们将依法积极配合处理，保护您的合法权益。
            </p>
        </div>
    </div>
</template>

<script type="text/ecmascript-6">
export default {
    data() {
        return {}
    },
    methods: {}
}
</script>

<style scoped lang="less">
.infofi {
    list-style-type: none;
}
.tel {
    text-decoration: none;
    color: #4a90e2;
}
.infonone {
    list-style-type: none;
    margin-left: 20px;
}
.info {
    list-style-type: decimal;
    margin-left: 20px;
}
.h1 {
    font-size: 16px;
    font-weight: bold;
    margin: 8px 0;
}
.bold {
    font-weight: bold;
}
.about-list {
    width: 100%;
    height: auto;
    background: linear-gradient(top, #242646, #07090f);
    font-size: 14px;
    color: #fff;
    position: relative;

    &.fix-background {
        position: fixed;
        height: 100%;
        overflow: scroll;
    }
}
.visbody-fit {
    width: 90%;
    padding: 20px 0 0px;
    margin: 0 auto;
    text-align: left;
    font-size: 30px;

    .version-number {
        font-size: 25px;
        font-weight: 900;
    }
    .version-number-1 {
        font-size: 22px;
        font-weight: 700;
    }
    .version-number-2 {
        font-size: 18px;
        font-weight: 600;
    }
}
.notice-cont {
    text-align: left;
    margin: 0 auto;
    padding: 20px;
    font-size: 14px;
    line-height: 24px;

    .title-1 {
        font-size: 17px;
        font-weight: 600;
        color: #fff;
    }
    .title-2 {
        font-size: 15px;
        font-weight: 600;
        color: #fff;
    }
    .span-view {
        font-weight: bold;
    }

    p {
      margin-top: 7px;
      color: #AAB5CF;
    }

    .custom-bullet{
        display: flex;
        flex-direction: row;
        align-items: flex-start; /* 关键：禁止拉伸 */
        margin-top: 3px; /* 注意：单位不能省略，如 3px */
        .bullet-icon {
            display: inline-block;
            width: 6px;
            height: 6px;
            background-color: #fff;
            border-radius: 50%;
            margin-right: 10px;
            margin-left: 10px;
            margin-top: 9px; /* 调整圆点垂直位置 */
            flex-shrink: 0; /* 可选：防止圆点被压缩 */
        }
        .bullet-icon-1 {
            display: inline-block;
            width: 6px;
            height: 6px;
            background-color: transparent; /* 背景透明 */
            border: 1px solid #fff; /* 白色边框（1px 粗细） */
            border-radius: 50%; /* 圆形 */
            margin-right: 10px;
            margin-left: 20px;
            margin-top: 9px;
            flex-shrink: 0; /* 防止压缩 */
            box-sizing: border-box; /* 确保边框不增加元素尺寸 */
        }
        .span-view {
            font-weight: bold;
        }
        .title {
            margin-right: 10px;
            margin-left: 10px;
        }
    }
}
.version-number {
    font-size: 16px;
    line-height: 22px;
    letter-spacing: 1px;
}
</style>
