<template>
    <div class="about-list fix-background">
        <!-- 关于我们 -->
        <div class="visbody-fit">
            <span class="version-number">用户隐私协议</span>
        </div>
        <div class="notice-cont">
            <p>本政策仅适用于维塑智能科技提供的Visbodyfit系列产品或服务。</p>
            <p>最近更新日期：2021.12.12</p>
            <p>如果您有任何疑问、意见或建议，请通过以下方式与我们联系：</p>
            <p>电子邮件：info@suanier.com</p>
            <p>电话：400-161-7020</p>
            <p>本政策将帮助您了解以下内容：</p>
            <ul class="infofi">
                <li>一、我们如何收集您的个人信息；</li>
                <li>二、我们如何使用您的个人信息；</li>
                <li>三、我们如何使用cookie和同类技术；</li>
                <li>四、我们如何存储和保护个人信息；</li>
                <li>五、我们如何共享、转让、公开披露您的个人信息；</li>
                <li>六、我们如何处理儿童的个人信息；</li>
                <li>七、对第三方责任的申明；</li>
                <li>八、本政策的适用及更新；</li>
            </ul>
            <p>维塑智能科技深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。</p>
            <p>同时，维塑科技承诺，我们将按业内成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。</p>
            <p>请您在使用我们服务前，仔细阅读并了解本《隐私政策》。</p>
            <br />

            <p class="h1">一、我们如何收集您的个人信息</p>
            <ul class="infonone">
                <li>为向您提供我们的服务，我们将在法律允许范围内和当您使用产品某些功能和服务时，根据本政策规定收集您的个人信息。如果您不提供这些信息，我们可能无法向您提供我们的产品和服务。</li>
                <li>我们根据合法、正当、必要的原则，仅收集实现产品功能所必要的信息。</li>
                <li>维塑科技仅会出于本政策所述的以下目的，收集和使用您的个人信息：</li>
            </ul>

            <p class="h1">1、注册成为用户</p>
            <ul class="infonone">
                <li>为完成创建账号，你需要提供以下信息：手机号码，性别，身高，微信昵称、微信头像、年龄等；</li>
                <li>由于不同的应用环境，我们还可能收集您的脸部识别信息、注册有您个人信息的手环信息。</li>
            </ul>

            <p class="h1">2、身体成分测量</p>
            <ul class="infonone">
                <li>为提供给您更加精准、专业的体成分测量数据，您授权我们收集您的身体成分数据信息，如体重、体脂率、BMI、体脂肪、去脂体重、无机盐、蛋白质、总水分、骨骼肌、肌肉量、左上肢肌肉量、右上肢肌肉量、躯干肌肉量、左下肢肌肉量、右下肢肌肉量、躯干体脂肪、右下肢体脂肪、左下肢体脂肪、内脏脂肪等级、基础代谢。随着产品升级，提供给您的身体成分测量参数会增加，我们会以版本更新的方式通知您，并更新隐私协议。</li>
            </ul>

            <p class="h1">3、三维模型重建</p>
            <ul class="infonone">
                <li>为提供给您精确的三维模型重建，我们将采集您的深度图像信息，并根据这些深度信息构建您的三维体型。</li>
                <li>您授权我们收集左上臂围、右上臂围、胸围、腰围、左大腿围、右大腿围、左小腿围、右小腿围、臀围等围度信息。随着产品升级，提供给您的身体围度测量参数会增加，我们会以版本更新的方式通知您，并更新隐私协议。</li>
                <li>注：深度图像中像素值反应场景中物体到相机的距离。</li>
            </ul>

            <p class="h1">二、我们如何使用您的个人信息</p>
            <p class="h1">1、您在使用服务时上传的信息</p>
            <ul class="infonone">
                <li>例如，您在使用产品时上传的深度图信息、设备测量的身体成分信息。我们将利用您的深度图信息为您提供3D人体模型合成。我们还会使用您的身体阻抗信息为您进行身体成分的检测，为您提供专业的健康检测服务。</li>
                <li>我们需将您的如上信息上传到我们的服务器进行计算，计算完毕后将您的三维模型以及体测数据返回给您。</li>
                <li>正常情况下，这些数据无法用于识别任何特定的个人。</li>
            </ul>

            <p class="h1">2、日志信息</p>
            <ul class="infonone">
                <li>当您使用我们的服务时，我们可能会自动收集相关信息并存储为服务日志信息。</li>
            </ul>

            <p class="h1">3、基础数据</p>
            <ul class="infonone">
                <li>基础数据通常是与用户内容相关的技术数据，例如您使用设备所提供的3D体测服务时，我们会收集您在使用过程中的深度图信息、身体阻抗信息。</li>
                <li>当您在使用我们的服务时，我们将利用您的深度图信息为您提供3D人体模型合成。我们还会使用您的身体阻抗信息为您进行身体成分的检测，为您提供专业的健康检测服务。</li>
                <li>我们需将您的如上信息上传到我们的服务器进行计算，计算完毕后将您的三维模型以及体测数据返回给您。</li>
                <li>正常情况下，这些数据无法用于识别任何特定的个人。</li>
            </ul>

            <p class="h1">4、服务提升</p>
            <ul class="infonone">
                <li>我们会采取脱敏、去标识化等方式对您的信息进行综合统计、分析加工，以便为您提供更加准确、个性、流畅及便捷的服务，或帮助我们评估、改善或设计服务及运营活动；</li>
                <li>为了提升用户服务体验，我们可能会根据用户信息形成群体特征标签，用于向用户提供其更加精准的专业报告服务，此种形式仅存在于技术开发环境中。</li>
                <li>当我们要将信息用于本政策未载明的其他用途时，会按照法律法规及国家标准的要求以确认协议、具体场景下的文案确认动作等形式再次征得您的同意。</li>
            </ul>

            <p class="h1">5、数据安全</p>
            <ul class="infonone">
                <li>为了保障服务的稳定性与安全性，我们会将您的信息用于身份验证、降低风险、存档和备份用途；</li>
            </ul>

            <p class="h1">6、用户调研</p>
            <ul class="infonone">
                <li>邀请您参与我们服务有关的客户调研；</li>
            </ul>

            <p class="h1">三、我们如何使用cookie等同类技术</p>
            <ul class="infonone">
                <li>为使您获得更轻松的访问体验，您访问维塑网站或使用维塑服务时，我们可能会通过小型数据文件识别您的身份，这么做可帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全状态。这些数据文件可能是Cookie，Flash Cookie，您的浏览器或关联应用程序提供的其他本地存储（以下简称“Cookie”）。请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝维塑的Cookie。多数浏览器工具条中的“帮助”部分会告诉您怎样防止您的浏览器接受新的Cookie，怎样让您的浏览器在您收到一条新Cookie时通知您或者怎样彻底关闭Cookie。此外，您可以通过改变浏览器附加程序的设置，或通过访问提供商的网页，来关闭或删除浏览器附加程序使用的Flash Cookie及类似数据。但这一举动在某些情况下可能会影响您安全访问维塑网站和使用维塑提供的服务。</li>
                <li>我们网站上还可能包含一些电子图像（以下简称“网络Beacon”），使用网络Beacon可以帮助网站计算浏览网页的用户或访问某些Cookie，我们会通过网络Beacon收集您浏览网页活动的信息（您访问的页面地址、您先前访问的援引页面的位置、您的浏览环境以及显示设定）。</li>
                <li>如您通过我们的网站或APP，使用了由第三方而非维塑提供的服务时，为尽力确保您的账号安全，使您获得更安全的访问体验，我们可能会使用专用的网络协议及代理技术（以下简称“Proxy技术”）。使用Proxy技术，可以帮助您识别到我们已知的高风险站点，减少由此引起的钓鱼、账号泄露等风险，同时更有利于保障您和第三方的共同权益，阻止不法分子篡改您和您希望访问的第三方之间正常服务内容，包括：不安全路由器、非法基站等引起的广告注入、非法内容篡改。在此过程中，我们也可能会获得和保存您设备的IP地址、硬件ID以及您访问的页面位置。</li>
            </ul>

            <p class="h1">四、我们如何存储和保护信息</p>
            <ul class="infonone">
                <li>我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内。</li>
                <li>为了保障您的信息安全，我们在收集您的信息后，将采取各种合理必要的措施保护您的信息。例如，在技术开发环境当中，我们仅使用经过去标识化处理的信息进行统计分析；我们会将去标识化后的信息与可用于恢复识别个人的信息分开存储，确保在针对去标识化信息的后续处理中不重新识别个人。</li>
                <li>我们承诺我们将使信息安全保护达到业界领先的安全水平。为保障您的信息安全，我们致力于使用各种安全技术及配套的管理体系来尽量降低您的信息被泄露、毁损、误用、非授权访问、非授权披露和更改的风险。</li>
                <li>例如：通过网络安全层软件（SSL）进行加密传输、信息加密存储、严格限制数据中心的访问。</li>
                <li>传输和存储个人敏感信息时，我们将采用加密、权限控制、去标识化等安全措施。</li>
                <li>我们设立了个人信息保护责任部门，针对个人信息收集、使用、共享、委托处理等开展个人信息安全影响评估。</li>
                <li>同时，我们建立了相关内控制度，对可能接触到您的信息的工作人员采取最小够用授权原则；</li>
                <li>对工作人员处理您的信息的行为进行系统监控，不断对工作人员培训相关法律法规及隐私安全准则和安全意识强化宣导。</li>
            </ul>

            <p class="h1">五、我们如何分享、转让和公开个人信息</p>
            <p class="h1">1、信息分享和对外提供</p>
            <ul class="infonone">
                <li>为了遵守国家法律法规及监管要求，以及向您提供服务及提升服务质量，我们会在以下情形中会对您的信息进行分享以及对外提供：</li>
                <li>1) 获取您的同意，经过您事先同意我们可能与第三方分享您的个人信息；</li>
                <li>2) 为实现外部处理的目的，我们可能会与关联公司或者其他第三方合作伙伴（第三方服务供应商、代理商、应用开发者等）分享您的个人信息。</li>
                <li>3) 与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如健身房、医疗机构、美容机构、服装定制等，我们必须提供您的检测结果给合作伙伴，合作伙伴才能给您讲解检测结果报告中的内容，并为您安排更加专业的健身、锻炼、服装定制等专业服务。在您使用我们的产品前，我们的合作伙伴会向您说明功能以及为您提供的服务内容。</li>
                <li>我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。</li>
                <li>需要特别说明的是，对最终用户相关信息如何在第三方服务企业，如健身房、医疗机构、美容机构、服装定制商等，由企业用户决定并管理。</li>
                <li>4) 合作伙伴会按照我们的说明、隐私政策以及其他相关保密和安全措施来为我们处理您的个人信息，并用于向您提供我们的服务，实现“我们如何使用信息”部分所述目的。</li>
            </ul>

            <p class="h1">2、转让</p>
            <ul class="infonone">
                <li>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</li>
                <li>1）在获取明确同意的情况下转让：获取您的明确同意后，我们会向他方转让您的和人信息；</li>
                <li>2）随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知你相关情形，按照法律法规及不低于本指引所要求的标准继续保护或要求新的控制者继续保护你的个人信息。</li>
            </ul>

            <p class="h1">3、公开披露</p>
            <ul class="infonone">
                <li>我们仅会在以下情况，公开披露您的个人信息：</li>
                <li>1）获得您的明确同意后；</li>
                <li>2）基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息；</li>
            </ul>

            <p class="h1">六、我们如何处理儿童的个人信息</p>
            <ul class="infonone">
                <li>1、我们期望父母或监护人指导未成年人使用我们的服务。我们将根据国家相关法律法规的规定保护未成年人的信息的保密性及安全性。</li>
                <li>2、如您为未成年人，建议请您的父母或监护人阅读本政策，并在征得您父母或监护人同意的前提下使用我们的服务或向我们提供您的信息。对于经父母或监护人同意而收集您的信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护您的权益所必要的情况下使用或公开披露此信息。如您的监护人不同意您按照本政策使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。</li>
                <li>3、如您为未成年人的父母或监护人，当您对您所监护的未成年人的信息处理存在疑问时，请通过上文中的联系方式联系我们。</li>
            </ul>

            <p class="h1">七、对第三方责任的声明</p>
            <ul class="infonone">
                <li>请您注意，您所使用的非“维塑”微信公众号、小程序、或者APP、通过我们接入的第三方服务（例如：您所在健身房公众号、APP）可能有自己的隐私权保护政策；</li>
                <li>当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方可能会放置他们自己的Cookie或网络Beacon，这些Cookie或网络Beacon不受我们的控制，且它们的使用不受本政策的约束。</li>
                <li>我们会努力去要求这些主体对您的个人信息采取保护措施，建议您与他们联系以获得关于他们的隐私权政策的详细情况。如您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。</li>
            </ul>

            <p class="h1">八、本政策的适用及更新</p>
            <ul class="infonone">
                <li>所有服务均适用本政策，除非相关服务已有独立的隐私权政策或相应的用户服务协议当中存在特殊约定。</li>
                <li>发生下列重大变化情形时，我们会适时对本政策进行更新：</li>
                <li>
                    <ul class="infonone">
                        <li>（1）我们的基本情况发生变化，例如：兼并、收购、重组引起的所有者变更；</li>
                        <li>（2）收集、存储、使用个人信息的范围、目的、规则发生变化；</li>
                        <li>（3）对外提供个人信息的对象、范围、目的发生变化；</li>
                        <li>（4）您访问和管理个人信息的方式发生变化；</li>
                        <li>（5）数据安全能力、信息安全风险发生变化；</li>
                        <li>（6）用户询问、投诉的渠道和机制，以及外部纠纷解决机构及联络方式发生变化；</li>
                        <li>（7）其他可能对您的个人信息权益产生重大影响的变化。</li>
                    </ul>
                </li>
            </ul>
        </div>
    </div>
</template>

<script type="text/ecmascript-6">
export default {
    data() {
        return {}
    },
    methods: {}
}
</script>

<style scoped lang="less">
.infofi {
    list-style-type: none;
}
.tel {
    text-decoration: none;
    color: #4a90e2;
}
.infonone {
    list-style-type: none;
    margin-left: 20px;
}
.info {
    list-style-type: decimal;
    margin-left: 20px;
}
.h1 {
    font-size: 16px;
    font-weight: bold;
    margin: 8px 0;
}
.bold {
    font-weight: bold;
}
.about-list {
    width: 100%;
    height: auto;
    background: linear-gradient(top, #242646, #07090f);
    font-size: 14px;
    color: #fff;
    position: relative;

    &.fix-background {
        position: fixed;
        height: 100%;
        overflow: scroll;
    }
}
.visbody-fit {
    width: 90%;
    padding: 30px 0 10px;
    margin: 0 auto;
    text-align: left;
    border-bottom: 1px solid rgba(255, 255, 255, 0.2);
}
.notice-cont {
    text-align: left;
    margin: 0 auto;
    padding: 20px;
    font-size: 14px;
    line-height: 24px;
}
.version-number {
    font-size: 16px;
    line-height: 22px;
    letter-spacing: 1px;
}
</style>
