<template>
    <div class="about-list fix-background">
        <!-- 关于我们 -->
        <div class="visbody-fit">
            <span class="version-number">《用户使用协议》</span>
        </div>
        <div class="notice-cont">
            <p class="h1">特别提示</p>
            <span>在此特别提醒您，请您认真阅读《用户使用协议》（以下称“本协议”），确保您充分理解本协议中各条款。请您在慎重阅读后选择接受或不接受本协议。本协议是您使用维塑（以下简称“我们”）提供的微信端界面查看数据时所订立的具有法律效应的协议，您同意点击并确认本协议条款且通过授权微信登录或手机号码登录完成注册程序后，可享受我们为您提供的各类服务。您的注册、登录、使用行为将视为您同意并接受本协议中各项条款的约束。若您不同意本协议，请您立即停止用户注册程序。本协议中，“您”是指任何使用我们产品的个人或机构。根据国家法律法规和我们产品的运营需要，我们会适时修改相关规则，同步更新入本协议，协议公布后即生效。当您在使用我们的产品提供的服务时，我们即认为您将接受本协议内的所有条款，包括更新后的条款，如不同意任一条款，您应立即停止使用我们的产品。</span>

            <p class="h1">用户使用规范</p>
            <ul class="info">
                <li>当您使用我们提供的微信界面端查看报告时，您必须是成年人，如果不是成年人，您须在父母或法定监护人指导之下使用本服务，同时要充分阅读、知悉本协议内容。</li>
                <li>您可以通过微信分享或者公开您的三维人体扫描数据信息，并单独对此行为承担可能产生的责任与后果。</li>
                <li>使用我们提供的微信端查看报告服务时，需要联网，您需自行承担所产生的通讯费等相关费用。</li>
                <li>您在我们的扫描仪测量数据后，我们建议请勿用他人手机扫描获取结果报告，或者帮他人扫描获取结果报告，由此带来的数据不统一连续的问题由您承担相应后果。</li>
                <li>您同意在使用我们产品提供的服务时，不得产生以下行为：上传或发布病毒、蠕虫、恶意代码、故意破坏或改变计算机系统或数据的软件；未授权的情况下，收集其他用户的信息或数据，例如电子邮箱地址等。</li>
                <li>在您使用我们扫描仪测量围度数据时候，我们建议您尽量着装紧身，以使测量数据精度更加准确；为了更好的对比体型变化效果，我们建议每次测量着装尽量保持一致。同时，我们希望用户知悉，测量数据总难免因为用户每次测量姿势和位置不能完全一致而导致测量出现误差。我们也会尽量去提升测量精度，减少用户位置不一致产生的测量误差。</li>
                <li>您有权向我们提出申请删除您以往在使用我们产品的时候我们所采集的数据，包括围度信息、体成分信息数据以及注册个人信息，在您提出申请后，我们会在15个工作日内删除您相关的所有信息。</li>
                <li>
                    您同意在使用我们产品提供的数据报告时，不作出以下行为，否则，我们有权停止您对我们产品的使用，如您的行为造成我们损失的，您还需承担损失赔偿责任：
                    <ul class="ulchild">
                        <li>诋毁我们的数据报告，致使我们形象利益受损的；</li>
                        <li>对数据篡改，恶意造谣，散播谣言的；</li>
                        <li>利用数据报告漏洞，故意作出有损我们商业利益行为的；</li>
                        <li>违反本协议内容的；</li>
                        <li>利用技术手段破坏或者扰乱我们提供的微信端的服务；</li>
                    </ul>
                </li>
            </ul>

            <p class="h1">软件使用规范</p>
            <ul class="info">
                <li>我们不具有医疗保健执业资格，在诊断、检查或治疗方面没有任何医疗专业相关背景，软件上显示的体成分信息、健康评分以及体态评估结果和整体结论建议仅供参考，如若您确有需要，请您及时咨询具有医疗相关执业资格的机构或个人的专业意见，如您依据我们的评估结果进行自我诊断，产生的一切责任由您自行承担。</li>
                <li>您需要知道我们的数据测量中，由于某些不可避免的因素。诸如设备老化、服务异常、您体测时的位置、体测时身着的服装等影响测量结果而造成数据围度不准确，我们不承担数据测量误差产生的相关责任，该数据仅供您作为了解自身情况的参考。</li>
                <li>在您体测完成后，在我们提供的微信端查看数据时，您需要授权我们获取您的微信头像、微信姓名信息以及需要提供真实、准确、合法的注册资料，包括手机号、性别、年龄、身高、体重，如果资料不真实、不准确、不合法，您需承担由此带来的相应后果，同时我们保留终止为您提供服务的权利。</li>
            </ul>

            <p class="h1">授权</p>
            <ul class="info">
                <li>我们会与第三方客户合作，您需授权我们向第三方提供我们您在扫描仪测量得到的数据，并向第三方提供数据接口，以便第三方合作方为您提供数据报告服务。</li>
                <li>在您使用我们微信端界面提供的查看数据报告功能时，您需向我们授权我们访问获取您的微信姓名和头像信息用于登录，并提供相关注册信息包括手机号码、性别、年龄、身高、体重。</li>
            </ul>

            <p class="h1">免责</p>
            <p>有如下情形发生，我们不承担任何法律责任：</p>
            <ul class="info">
                <li>由于政府部门需要，依据法律法规提供您个人信息的。</li>
                <li>您使用不当或者其他自身原因导致个人信息泄露的，您对个人信息不正确的使用而导致个人损失的；或由于网络攻击、黑客入侵以致您的个人信息泄露的。</li>
                <li>由于网络异常、设备异常致使服务中断或者您未按操作指导使用产品而未能或准确提供人体数据的。</li>
                <li>我们的产品提供的体成分报告以及体态评估不具有医学指导意义，仅为您训练、查看自己身体情况提供的一个参考；您应理解并同意承担您使用我们提供的产品时，根据自己独立判断做出的行为而产生的风险。</li>
            </ul>

            <p class="h1">知识产权</p>
            <ul class="info">
                <li>维塑3D体型追踪仪拥有独立的知识产权，包括硬件结构、外观设计、维塑LOGO、文字、技术专利，任何单位和个人不得擅自拆卸产品试图获取产品内部信息以作商业用途。</li>
                <li>目前我们的产品提供的软件服务属于免费服务，根据经营需要，我们有可能在后续会针对某项服务收取额外费用，如需收费时，我们会通过更新协议让您知悉。届时若您需要继续使用服务，则需要按照新的价格规定支付费用，否则，您有权终止使用我们的服务。</li>
            </ul>

            <p class="h1">违约责任</p>
            <ul class="info">
                <li>您应该按本协议制定的规则合法使用我们的产品，您也应了解如果您违反本协议的任何条款，我们均可随时终止为您提供服务，同时有权利保留追究责任的权利，我们由此产生的损失也由您一并承担。</li>
                <li>因您违反本协议或其他个人原因，致使与我们合作的第三方利益受损的，我们由此产生的利益受损的，由您承担损失赔偿责任。</li>
            </ul>

            <p class="h1">其他</p>
            <ul class="info">
                <li>
                    用户隐私保护
                    <br />我们提供产品服务时，提供了《用户隐私协议》保护您的隐私安全，您应同意并知悉我们对于您的信息处理和保护方式。
                </li>
                <li>本协议的制定、执行均适用于中华人民共和国法律，双方应本着友好协商的原则处理产生的纠纷，协商不成的您可向我们公司所在地（即西安市未央区）人民法院提起诉讼。</li>
                <li>如您对以上条款有任何异议和建议，均可联系我们029-8655-0582。</li>
            </ul>
        </div>
    </div>
</template>

<script type="text/ecmascript-6">
export default {
    data() {
        return {}
    },
    methods: {}
}
</script>

<style scoped lang="less">
.info {
    list-style-type: decimal;
    margin-left: 20px;
}
.ulchild {
    margin-left: 20px;
    list-style-type: lower-roman;
}
.h1 {
    font-size: 16px;
    font-weight: bold;
    margin: 8px 0;
}
.bold {
    font-weight: bold;
}
.about-list {
    width: 100%;
    height: auto;
    background: linear-gradient(top, #242646, #07090f);
    font-size: 14px;
    color: #fff;
    position: relative;

    &.fix-background {
        position: fixed;
        height: 100%;
        overflow: scroll;
    }
}
.visbody-fit {
    width: 90%;
    padding: 30px 0 10px;
    margin: 0 auto;
    text-align: left;
    border-bottom: 1px solid rgba(255, 255, 255, 0.2);
}
.notice-cont {
    text-align: left;
    margin: 0 auto;
    padding: 20px;
    font-size: 14px;
    line-height: 24px;
}
.version-number {
    font-size: 16px;
    line-height: 22px;
    letter-spacing: 1px;
}
</style>
